<?php

namespace App\Libraries;

class RandJP{
  public function rand_hiragana($length)
  {
    static $chars = array(
      'ぁ', 'ぃ', 'ぅ', 'ぇ', 'ぉ',
      'あ', 'い', 'う', 'え', 'お',
      'か', 'き', 'く', 'け', 'こ',
      'が', 'ぎ', 'ぐ', 'げ', 'ご',
      'さ', 'し', 'す', 'せ', 'そ',
      'ざ', 'じ', 'ず', 'ぜ', 'ぞ',
      'っ',
      'た', 'ち', 'つ', 'て', 'と',
      'だ', 'ぢ', 'づ', 'で', 'ど',
      'な', 'に', 'ぬ', 'ね', 'の',
      'は', 'ひ', 'ふ', 'へ', 'ほ',
      'ば', 'び', 'ぶ', 'べ', 'ぼ',
      'ぱ', 'ぴ', 'ぷ', 'ぺ', 'ぽ',
      'ま', 'み', 'む', 'め', 'も',
      'ゃ', 'ゅ', 'ょ',
      'や', 'ゆ', 'よ',
      'ゎ',
      'わ', 'を', 'ん',
    );
    $str = '';
    for ($i = 0; $i < $length; ++$i) {
      $str .= $chars[array_rand($chars)];
    }
    return $str;
  }
  public function rand_katakana($length)
  {
    static $chars = array(
      'ァ', 'ィ', 'ゥ', 'ェ', 'ォ',
      'ア', 'イ', 'ウ', 'エ', 'オ',
      'カ', 'キ', 'ク', 'ケ', 'コ',
      'ガ', 'ギ', 'グ', 'ゲ', 'ゴ',
      'サ', 'シ', 'ス', 'セ', 'ソ',
      'ザ', 'ジ', 'ズ', 'ゼ', 'ゾ',
      'ッ',
      'タ', 'チ', 'ツ', 'テ', 'ト',
      'ダ', 'ヂ', 'ヅ', 'デ', 'ド',
      'ナ', 'ナ', 'ヌ', 'ネ', 'ノ',
      'ハ', 'ヒ', 'フ', 'ヘ', 'ホ',
      'バ', 'ビ', 'ブ', 'ベ', 'ボ',
      'パ', 'ピ', 'プ', 'ペ', 'ポ',
      'マ', 'ミ', 'ム', 'メ', 'モ',
      'ャ', 'ュ', 'ョ',
      'ヤ', 'ユ', 'ヨ',
      'ヮ',
      'ワ', 'ヲ', 'ン',
    );
    $str = '';
    for ($i = 0; $i < $length; ++$i) {
      $str .= $chars[array_rand($chars)];
    }
    return $str;
  }
}
